Core/src/InformationRegisters/ПМ_РозничныеПродажи/ПМ_РозничныеПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПМ_РозничныеПродажи</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОбмена</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура_Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура_Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения_Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПереработчикуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИмпорта</name>
    <type>
      <types>CatalogRef.ПроцентыИмпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДляЧекаККМ</name>
    <type>
      <types>EnumRef.ВидыЧековДляНоменклатурыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Усушка_Потери</name>
    <type>
      <types>CatalogRef.Потери</types>
    </type>
  </attributes>
  <attributes>
    <name>Усушка_СписаниеНаПотери</name>
    <type>
      <types>CatalogRef.СписаниеНаПотери</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНомерЯчейки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpНоменклатурныеГруппы</name>
    <type>
      <types>CatalogRef.AzRytmpНоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpGUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/НоменклатураККМ/НоменклатураККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураККМ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.КассыККМ</owners>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/CommonModules/ПМ_РозничныеПродажи/Module.bsl
Функция ВосстановлениеJSON(Свойство, Значение, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если Свойство = "orderdate" Тогда
		//"01/11/2018 16:17:33"
		//переводим в формат YYYYMMDDHHMMSS
		Г=Сред(Значение,7,4);
		М=Сред(Значение,4,2);
		Д=Лев(Значение,2);
		ч=Сред(Значение,12,2);
		мн=Сред(Значение,15,2);
		с=Прав(Значение,2);
		Возврат Дата(г+м+д+ч+мн+с);
	ИначеЕсли Свойство="price" ИЛИ Свойство="quantity" ИЛИ Свойство="unitpriceprice" Тогда
		Возврат Число(Значение);
	ИначеЕсли Свойство = "ДатаОбмена" Тогда	
		//"01/11/2018 16:17:33"
		//переводим в формат YYYYMMDDHHMMSS
		Г=Сред(Значение,7,4);
		М=Сред(Значение,4,2);
		Д=Лев(Значение,2);
		ч="00";
		мн="00";
		с="00";
		Возврат Дата(г+м+д+ч+мн+с);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//Процедура выполняется в фоне после загрузки данных из удаленных рабочих мест в регистры ПМ_РозничныеПродажи и ПМ_РозничныеПродажи_Оплата
//В справочнике Номенклатура поставщика обновляется номенклатура
//в регистре ПМ_РозничныеПродажи заполняется номенклатура и единица измерения
Процедура ЗаполнитьНоменклатуруПоставщика(ПараметрыОбмена, АдресРезультата = Неопределено) Экспорт
	КассаККМ=ПараметрыОбмена.КассаККМ;
	ДатаОбмена=ПараметрыОбмена.ДатаОбмена;
	Если ТипЗнч(ДатаОбмена)=Тип("Строка") Тогда
	  ДатаОбмена=ВосстановлениеJSON("ДатаОбмена",ДатаОбмена);
	КонецЕсли; 
	тз=ПолучитьТаблицуСоответствий(КассаККМ, ДатаОбмена);
	Рег=РегистрыСведений.ПМ_РозничныеПродажи.СоздатьНаборЗаписей();
	Для каждого Выборка Из тз Цикл
		Рег.Отбор.КассаККМ.Установить(КассаККМ);
		Рег.Отбор.ДатаОбмена.Установить(ДатаОбмена);
		Рег.Отбор.Номенклатура_Наименование.Установить(Выборка.Номенклатура_Наименование);
		Рег.Отбор.Номенклатура_Код.Установить(Выборка.Номенклатура_Код);
		Рег.Отбор.ЕдиницаИзмерения_Наименование.Установить(Выборка.ЕдиницаИзмерения_Наименование);
		Рег.Прочитать();
		Записан=Ложь;
		Для каждого стр Из рег Цикл
		  Если ЗначениеЗаполнено(стр.Номенклатура) И ЗначениеЗаполнено(стр.ЕдиницаИзмерения) Тогда
			  Продолжить;
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(стр,Выборка,"Номенклатура,ЕдиницаИзмерения");		
			Записан=Истина;
		КонецЦикла; 
		Если Записан Тогда
			Попытка
		  	Рег.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;			
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

//Все=Ложь - возвращает таблицу номенклатуры, у которой найдено соответствие
//Все=Истина - возвращает все записи регистра
Функция ПолучитьТаблицуСоответствий(КассаККМ, ДатаОбмена, Все=Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	&КассаККМ,
	|	&ДатаОбмена,
	|	ПМ_РозничныеПродажи.Номенклатура_Код,
	|	ПМ_РозничныеПродажи.Номенклатура_Наименование,
	|	ПМ_РозничныеПродажи.ЕдиницаИзмерения_Наименование,
	|	СУММА(ПМ_РозничныеПродажи.Количество) КАК Количество,
	|	СУММА(ПМ_РозничныеПродажи.Сумма) КАК Сумма,
	|	ПМ_РозничныеПродажи.Номенклатура,
	|	ПМ_РозничныеПродажи.ЕдиницаИзмерения
	|ПОМЕСТИТЬ рег
	|ИЗ
	|	РегистрСведений.ПМ_РозничныеПродажи КАК ПМ_РозничныеПродажи
	|ГДЕ
	|	ПМ_РозничныеПродажи.КассаККМ = &КассаККМ
	|	И ПМ_РозничныеПродажи.ДатаОбмена = &ДатаОбмена
	|
	|СГРУППИРОВАТЬ ПО
	|	ПМ_РозничныеПродажи.Номенклатура_Код,
	|	ПМ_РозничныеПродажи.Номенклатура_Наименование,
	|	ПМ_РозничныеПродажи.ЕдиницаИзмерения_Наименование,
	|	ПМ_РозничныеПродажи.Номенклатура,
	|	ПМ_РозничныеПродажи.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НоменклатураККМ.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК знНоменклатура,
	|	рег.КассаККМ,
	|	рег.ДатаОбмена,
	|	рег.Номенклатура_Код,
	|	рег.Номенклатура_Наименование,
	|	рег.ЕдиницаИзмерения_Наименование,
	|	рег.Количество,
	|	рег.Сумма,
	|	ВЫБОР
	|		КОГДА рег.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|				ИЛИ рег.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|				ИЛИ рег.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(НоменклатураККМ.Номенклатура.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ рег.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ спр_ККМ
	|ИЗ
	|	рег КАК рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураККМ КАК НоменклатураККМ
	|		ПО рег.Номенклатура_Код = НоменклатураККМ.Идентификатор
	|			И рег.Номенклатура_Наименование = НоменклатураККМ.Наименование
	|			И (НЕ НоменклатураККМ.ПометкаУдаления)
	|ГДЕ
	|	НЕ НоменклатураККМ.Номенклатура ЕСТЬ NULL
	|	И НоменклатураККМ.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НоменклатураККМ.Владелец = &КассаККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спр_ККМ.знНоменклатура КАК знНоменклатура,
	|	спр_ККМ.КассаККМ,
	|	спр_ККМ.ДатаОбмена,
	|	спр_ККМ.Номенклатура_Код,
	|	спр_ККМ.Номенклатура_Наименование,
	|	спр_ККМ.ЕдиницаИзмерения_Наименование,
	|	спр_ККМ.Количество,
	|	спр_ККМ.Сумма,
	|	спр_ККМ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ спр
	|ИЗ
	|	спр_ККМ КАК спр_ККМ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НоменклатураККМ.Номенклатура,
	|	спр_ККМ.КассаККМ,
	|	спр_ККМ.ДатаОбмена,
	|	спр_ККМ.Номенклатура_Код,
	|	спр_ККМ.Номенклатура_Наименование,
	|	спр_ККМ.ЕдиницаИзмерения_Наименование,
	|	спр_ККМ.Количество,
	|	спр_ККМ.Сумма,
	|	ВЫБОР
	|		КОГДА спр_ККМ.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЕСТЬNULL(НоменклатураККМ.Номенклатура.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ спр_ККМ.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	спр_ККМ КАК спр_ККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураККМ КАК НоменклатураККМ
	|		ПО спр_ККМ.Номенклатура_Код = НоменклатураККМ.Идентификатор
	|			И спр_ККМ.Номенклатура_Наименование = НоменклатураККМ.Наименование
	|ГДЕ
	|	НЕ НоменклатураККМ.Номенклатура ЕСТЬ NULL
	|	И НоменклатураККМ.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НоменклатураККМ.Владелец <> &КассаККМ
	|	И спр_ККМ.знНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спр.Номенклатура_Код,
	|	спр.Номенклатура_Наименование,
	|	спр.знНоменклатура,
	|	спр.ЕдиницаИзмерения_Наименование,
	|	спр.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	спр.Количество,
	|	спр.Сумма,
	|	спр.КассаККМ,
	|	спр.ДатаОбмена,
	|	ВЫБОР
	|		КОГДА спр.знНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ спр.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|				ИЛИ спр.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|				ИЛИ спр.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Флаг
	|ПОМЕСТИТЬ спрНоменклатураПоставщика
	|ИЗ
	|	спр КАК спр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спрНоменклатураПоставщика.ЕдиницаИзмерения,
	|	спрНоменклатураПоставщика.КассаККМ,
	|	спрНоменклатураПоставщика.ДатаОбмена,
	|	спрНоменклатураПоставщика.Номенклатура_Код,
	|	спрНоменклатураПоставщика.Номенклатура_Наименование КАК Номенклатура_Наименование,
	|	спрНоменклатураПоставщика.ЕдиницаИзмерения_Наименование КАК ЕдиницаИзмерения_Наименование,
	|	спрНоменклатураПоставщика.знНоменклатура КАК Номенклатура,
	|	спрНоменклатураПоставщика.Количество КАК Количество,
	|	спрНоменклатураПоставщика.Сумма КАК Сумма,
	|	спрНоменклатураПоставщика.Флаг
	|ИЗ
	|	спрНоменклатураПоставщика КАК спрНоменклатураПоставщика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	рег.ЕдиницаИзмерения,
	|	рег.КассаККМ,
	|	рег.ДатаОбмена,
	|	рег.Номенклатура_Код,
	|	рег.Номенклатура_Наименование,
	|	рег.ЕдиницаИзмерения_Наименование,
	|	рег.Номенклатура,
	|	рег.Количество,
	|	рег.Сумма,
	|	ВЫБОР
	|		КОГДА рег.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ рег.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|				ИЛИ рег.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|				ИЛИ рег.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	рег КАК рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ спрНоменклатураПоставщика КАК спрНоменклатураПоставщика
	|		ПО рег.КассаККМ = спрНоменклатураПоставщика.КассаККМ
	|			И рег.ДатаОбмена = спрНоменклатураПоставщика.ДатаОбмена
	|			И рег.Номенклатура_Код = спрНоменклатураПоставщика.Номенклатура_Код
	|			И рег.Номенклатура_Наименование = спрНоменклатураПоставщика.Номенклатура_Наименование
	|			И рег.ЕдиницаИзмерения_Наименование = спрНоменклатураПоставщика.ЕдиницаИзмерения_Наименование
	|			И рег.Количество = спрНоменклатураПоставщика.Количество
	|			И рег.Сумма = спрНоменклатураПоставщика.Сумма
	|ГДЕ
	|	&Все = ИСТИНА
	|	И спрНоменклатураПоставщика.знНоменклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("КассаККМ",КассаККМ);
	Запрос.УстановитьПараметр("ДатаОбмена",ДатаОбмена);
	Запрос.УстановитьПараметр("Все",Все);
  Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуСоответсвий()
